def atbash(tt):
    result = ""
    for i in tt:
        if i.isalpha():
            if i.isupper():
                result += chr(1071 - ord(i) + 1040)
            else:
                result += chr(1103 - ord(i) + 1072)
        else:
            result += i
    return result


def cezar(input_data):
    al = ['а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф',
          'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']
    ss = 5
    tt = input_data
    answer = ""
    for x in tt:
        if x in (".", ",", ";", ":", "_", "-", ")", "(", "<", ">", "!", "?", "=", "+", " "):
            answer += x
            continue
        flag = True
        if x.isupper():
            x = x.lower()
            flag = False
        ind = al.index(x)
        newind = (ind + ss) % len(al)
        x1 = al[newind]
        if flag == False:
            x1 = x.upper()
        answer += x1
    return answer



def morza(ar):
    morz= { 'А': '• _ - •',
        'Б': '• - - -',
        'В': '• - -',
        'Г': '- - •',
        'Д': '- • •',
        'Е': '•',
        'Ё': '• • - • •',
        'Ж': '- - - •',
        'З': '- - • •',
        'И': '• •',
        'Й': '• - - -',
        'К': '- • -',
        'Л': '• - • •',
        'М': '- -',
        'Н': '- •',
        'О': '- - -',
        'П': '• - - •',
        'Р': '• - •',
        'С': '• • •',
        'Т': '-',
        'У': '• • -',
        'Ф': '• • - •',
        'Х': '• • • •',
        'Ц': '- • - •',
        'Ч': '- - - •',
        'Ш': '- - - -',
        'Щ': '- • • •',
        'Ъ': '• - - • -',
        'Ы': '- • - -',
        'Ь': '- • • -',
        'Э': '• • - • •',
        'Ю': '• • - -',
        'Я': '• - • -',
        '1': '. ----',
        '2': '..---',
        '3':  '... --',
        '4':  '.... -',
        '5':  '.....',
        '6':  '-....',
        '7':  '--...',
        '8':  '---..',
        '9':  '----.',
        '0':  '-----',
        '.':  '·–·–·–',
        ',':  '–·–·–·',
        ':':  '— – – –',
        '-':  '— ···· —',
        '!':  '·–·–·–',
        '?':  '··––··',
        ' ': '...'
    }
    s = ''
    for i in range(len(ar)):
        s += morz[ar[i].upper()]
    return s
